---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
Document..::..Paint Method
Document Class See Also Send Feedback
---

# Overload List

|  | Name | Description |
| --- | --- | --- |
|  | Paint(ElementId, Face, ElementId) | Paint the element's face with specified material. |
|  | Paint(ElementId, Face, FamilyParameter) | Paint the element's face with specified material. |

# See Also

Document Class

Document Members

Autodesk.Revit.DB Namespace